results/rest/stage-100/payload-heavy/200VUs/repeat-2/200vus-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./src/rest/restTest.js
        output: json (./results/rest/stage-100/payload-heavy/200VUs/repeat-2/200vus.json)

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 200 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 200/200 VUs, 360 complete and 0 interrupted iterations
default   [   2% ] 200 VUs  0m01.0s/1m0s

running (0m02.0s), 200/200 VUs, 916 complete and 0 interrupted iterations
default   [   3% ] 200 VUs  0m02.0s/1m0s

running (0m03.0s), 200/200 VUs, 1506 complete and 0 interrupted iterations
default   [   5% ] 200 VUs  0m03.0s/1m0s

running (0m04.0s), 200/200 VUs, 2103 complete and 0 interrupted iterations
default   [   7% ] 200 VUs  0m04.0s/1m0s

running (0m05.0s), 200/200 VUs, 2701 complete and 0 interrupted iterations
default   [   8% ] 200 VUs  0m05.0s/1m0s

running (0m06.0s), 200/200 VUs, 3322 complete and 0 interrupted iterations
default   [  10% ] 200 VUs  0m06.0s/1m0s

running (0m07.0s), 200/200 VUs, 3937 complete and 0 interrupted iterations
default   [  12% ] 200 VUs  0m07.0s/1m0s

running (0m08.0s), 200/200 VUs, 4547 complete and 0 interrupted iterations
default   [  13% ] 200 VUs  0m08.0s/1m0s

running (0m09.0s), 200/200 VUs, 5157 complete and 0 interrupted iterations
default   [  15% ] 200 VUs  0m09.0s/1m0s

running (0m10.0s), 200/200 VUs, 5756 complete and 0 interrupted iterations
default   [  17% ] 200 VUs  0m10.0s/1m0s

running (0m11.0s), 200/200 VUs, 6361 complete and 0 interrupted iterations
default   [  18% ] 200 VUs  0m11.0s/1m0s

running (0m12.0s), 200/200 VUs, 6975 complete and 0 interrupted iterations
default   [  20% ] 200 VUs  0m12.0s/1m0s

running (0m13.0s), 200/200 VUs, 7583 complete and 0 interrupted iterations
default   [  22% ] 200 VUs  0m13.0s/1m0s

running (0m13.0s), 200/200 VUs, 8206 complete and 0 interrupted iterations
default   [  23% ] 200 VUs  0m14.0s/1m0s

running (0m14.0s), 200/200 VUs, 8827 complete and 0 interrupted iterations
default   [  25% ] 200 VUs  0m15.0s/1m0s

running (0m15.0s), 200/200 VUs, 9447 complete and 0 interrupted iterations
default   [  27% ] 200 VUs  0m16.0s/1m0s

running (0m16.0s), 200/200 VUs, 10080 complete and 0 interrupted iterations
default   [  28% ] 200 VUs  0m17.0s/1m0s

running (0m17.0s), 200/200 VUs, 10706 complete and 0 interrupted iterations
default   [  30% ] 200 VUs  0m18.0s/1m0s

running (0m18.0s), 200/200 VUs, 11323 complete and 0 interrupted iterations
default   [  32% ] 200 VUs  0m19.0s/1m0s

running (0m19.0s), 200/200 VUs, 11925 complete and 0 interrupted iterations
default   [  33% ] 200 VUs  0m20.0s/1m0s

running (0m20.0s), 200/200 VUs, 12552 complete and 0 interrupted iterations
default   [  35% ] 200 VUs  0m21.0s/1m0s

running (0m21.0s), 200/200 VUs, 13156 complete and 0 interrupted iterations
default   [  37% ] 200 VUs  0m22.0s/1m0s

running (0m22.0s), 200/200 VUs, 13784 complete and 0 interrupted iterations
default   [  38% ] 200 VUs  0m23.0s/1m0s

running (0m23.0s), 200/200 VUs, 14410 complete and 0 interrupted iterations
default   [  40% ] 200 VUs  0m24.0s/1m0s

running (0m24.0s), 200/200 VUs, 15020 complete and 0 interrupted iterations
default   [  42% ] 200 VUs  0m25.0s/1m0s

running (0m25.0s), 200/200 VUs, 15632 complete and 0 interrupted iterations
default   [  43% ] 200 VUs  0m26.0s/1m0s

running (0m26.0s), 200/200 VUs, 16271 complete and 0 interrupted iterations
default   [  45% ] 200 VUs  0m27.0s/1m0s

running (0m27.0s), 200/200 VUs, 16889 complete and 0 interrupted iterations
default   [  47% ] 200 VUs  0m28.0s/1m0s

running (0m28.0s), 200/200 VUs, 17526 complete and 0 interrupted iterations
default   [  48% ] 200 VUs  0m29.0s/1m0s

running (0m29.0s), 200/200 VUs, 18136 complete and 0 interrupted iterations
default   [  50% ] 200 VUs  0m30.0s/1m0s

running (0m30.0s), 200/200 VUs, 18766 complete and 0 interrupted iterations
default   [  52% ] 200 VUs  0m31.0s/1m0s

running (0m31.0s), 200/200 VUs, 19393 complete and 0 interrupted iterations
default   [  53% ] 200 VUs  0m32.0s/1m0s

running (0m32.0s), 200/200 VUs, 20029 complete and 0 interrupted iterations
default   [  55% ] 200 VUs  0m33.0s/1m0s

running (0m33.0s), 200/200 VUs, 20656 complete and 0 interrupted iterations
default   [  57% ] 200 VUs  0m34.0s/1m0s

running (0m34.0s), 200/200 VUs, 21277 complete and 0 interrupted iterations
default   [  58% ] 200 VUs  0m35.0s/1m0s

running (0m35.0s), 200/200 VUs, 21898 complete and 0 interrupted iterations
default   [  60% ] 200 VUs  0m36.0s/1m0s

running (0m36.0s), 200/200 VUs, 22519 complete and 0 interrupted iterations
default   [  62% ] 200 VUs  0m37.0s/1m0s

running (0m37.0s), 200/200 VUs, 23160 complete and 0 interrupted iterations
default   [  63% ] 200 VUs  0m38.0s/1m0s

running (0m38.0s), 200/200 VUs, 23779 complete and 0 interrupted iterations
default   [  65% ] 200 VUs  0m39.0s/1m0s

running (0m39.0s), 200/200 VUs, 24403 complete and 0 interrupted iterations
default   [  67% ] 200 VUs  0m40.0s/1m0s

running (0m40.0s), 200/200 VUs, 25032 complete and 0 interrupted iterations
default   [  68% ] 200 VUs  0m41.0s/1m0s

running (0m41.0s), 200/200 VUs, 25656 complete and 0 interrupted iterations
default   [  70% ] 200 VUs  0m42.0s/1m0s

running (0m42.0s), 200/200 VUs, 26285 complete and 0 interrupted iterations
default   [  72% ] 200 VUs  0m43.0s/1m0s

running (0m42.0s), 200/200 VUs, 26925 complete and 0 interrupted iterations
default   [  73% ] 200 VUs  0m44.0s/1m0s

running (0m43.0s), 200/200 VUs, 27559 complete and 0 interrupted iterations
default   [  75% ] 200 VUs  0m45.0s/1m0s

running (0m44.0s), 200/200 VUs, 28184 complete and 0 interrupted iterations
default   [  77% ] 200 VUs  0m46.0s/1m0s

running (0m45.0s), 200/200 VUs, 28807 complete and 0 interrupted iterations
default   [  78% ] 200 VUs  0m47.0s/1m0s

running (0m46.0s), 200/200 VUs, 29443 complete and 0 interrupted iterations
default   [  80% ] 200 VUs  0m48.0s/1m0s

running (0m47.0s), 200/200 VUs, 30069 complete and 0 interrupted iterations
default   [  82% ] 200 VUs  0m49.0s/1m0s

running (0m48.0s), 200/200 VUs, 30704 complete and 0 interrupted iterations
default   [  83% ] 200 VUs  0m50.0s/1m0s

running (0m49.0s), 200/200 VUs, 31323 complete and 0 interrupted iterations
default   [  85% ] 200 VUs  0m51.0s/1m0s

running (0m50.0s), 200/200 VUs, 31950 complete and 0 interrupted iterations
default   [  87% ] 200 VUs  0m52.0s/1m0s

running (0m51.0s), 200/200 VUs, 32570 complete and 0 interrupted iterations
default   [  88% ] 200 VUs  0m53.0s/1m0s

running (0m52.0s), 200/200 VUs, 33218 complete and 0 interrupted iterations
default   [  90% ] 200 VUs  0m54.0s/1m0s

running (0m53.0s), 200/200 VUs, 33857 complete and 0 interrupted iterations
default   [  92% ] 200 VUs  0m55.0s/1m0s

running (0m54.0s), 200/200 VUs, 34478 complete and 0 interrupted iterations
default   [  93% ] 200 VUs  0m56.0s/1m0s

running (0m55.0s), 200/200 VUs, 35114 complete and 0 interrupted iterations
default   [  95% ] 200 VUs  0m57.0s/1m0s

running (0m56.0s), 200/200 VUs, 35748 complete and 0 interrupted iterations
default   [  97% ] 200 VUs  0m58.0s/1m0s

running (0m57.0s), 200/200 VUs, 36385 complete and 0 interrupted iterations
default   [  98% ] 200 VUs  0m59.0s/1m0s

running (0m58.0s), 200/200 VUs, 37027 complete and 0 interrupted iterations
default   [ 100% ] 200 VUs  1m00.0s/1m0s


  █ TOTAL RESULTS 

    CUSTOM
    benchmark_slow_failure_rate....: 0.13%  51 out of 37243
    benchmark_total_failure_rate...: 0.13%  51 out of 37243

    HTTP
    http_req_duration..............: avg=316.62ms min=66.32µs  med=319ms    max=2.11s p(90)=335.08ms p(95)=341.17ms
      { expected_response:true }...: avg=316.62ms min=66.32µs  med=319ms    max=2.11s p(90)=335.08ms p(95)=341.17ms
    http_req_failed................: 0.00%  0 out of 37243
    http_reqs......................: 37243  638.817205/s

    EXECUTION
    iteration_duration.............: avg=322.86ms min=231.12ms med=319.48ms max=2.11s p(90)=335.4ms  p(95)=341.46ms
    iterations.....................: 37243  638.817205/s
    vus............................: 200    min=200         max=200
    vus_max........................: 200    min=200         max=200

    NETWORK
    data_received..................: 9.3 MB 159 kB/s
    data_sent......................: 1.2 GB 21 MB/s



running (0m58.3s), 000/200 VUs, 37243 complete and 0 interrupted iterations
default ✓ [ 100% ] 200 VUs  1m0s